---
layout: single
title: "[javascript] 04장_변수"
categories: javascript
tag: [study, javascript, frontend, ModernJavaScriptDeepDive]
toc: true
excerpt: "ModernJavaScriptDeepDive 도서의 04장_변수 정리"
---


# 4.1. 변수란 무엇인가? 왜 필요한가?
- 🏷️**변수: 하나의 값을 저장하기 위해 확보한 메모리 공간 또는 공간을 식별하기 위해 붙인 상징적인 이름**

- 컴퓨터는 **CPU**를 사용해 연산하고, **메모리**를 사용해 데이터를 기억함. 또, **1바이트 단위로 데이터를 저장하거나 읽어들이며**, 모든 데이터는 **모두 2진수로 저장**됨.
- **메모리 셀 하나는 1byte(8bit)** 이며, 각 셀은 고유의 메모리 주소를 가진다. 이 주소는 메모리 공간의 위치를 나타내며 주소 범위는 0x00000000부터 0xFFFFFFFF까지이다.

- 메모리 공간에 직접 접근해서 변수를 사용하는 것은 치명적 오류를 발생시킬 가능성이 높다. 따라서 프로그래밍 언어는 **변수**를 통해 기억하고 싶은 값을 메모리에 저장하고, 저장된 값을 읽어들여 재사용한다.
- 변수는 프로그래밍 언어의 컴파일러 또는 인터프리터에 의해 값이 저장된 메모리 공간의 주소로 치환되어 실행된다. 따라서 **개발자는 변수를 통해 직접 메모리 주소를 다루지 않고도, 안전하게 값에 접근할 수 있다.**
  
~~~javascript
예)
var result = 10 + 20; //10 + 20 연산을 통해 생성된 값 30을 result에 저장
~~~

- 위의 코드를 실행하면 메모리 공간에는 아래와 같이 할당된다.

![4-1]({{site.url}}/images/2025-09-14-javascript-2/1.png)


| 예제                    | 용어              | 설명                             |
| --------------------- | --------------- | ------------------------------ |
| `result`              | 변수 이름 (변수명)     | 메모리 공간에 저장된 값을 식별할 수 있는 고유한 이름 |
| `30`                  | 변수 값            | 변수에 저장된 실제 데이터                 |
| `result = 30`         | 할당 (Assignment) | 변수에 값을 저장하는 행위                 |
| `console.log(result)` | 참조 (Reference)  | 변수에 저장된 값을 읽어오는 행위             |


- 변수 이름을 통해 변수에 저장된 값의 의미를 명확히 할 수 있다. 그러므로 **변수 이름은 심사숙소해서 저장된 값의 의미를 파악할 수 있도록 지어야 한다.**

# 4.2. 식별자(=변수 이름)
- 🏷️**식별자: 어떤 값을 구별해서 식별할 수 있는 고유한 이름**
- 식별자는 값이 저장되어 있는 메모리 주소와 매핑 관계를 맺으며, 이 매핑 정보도 메모리에 저장된다.
  
![4-2]({{site.url}}/images/2025-09-14-javascript-2/2.png)

- 변수, 함수, 클래스 등 메모리 상에 존재하는 어떤값을 식별할 수있는 이름은 모두 식별자이다.
- 식별자는 **네이밍 규칙**을 준수해야하며, **선언**에 의해 자바스크립트 엔진에 식별자의 존재를 알린다.

# 4.3. 변수 선언
- 🏷️**변수 선언: 변수를 생성하는 것**
- 변수를 사용하기 위해 값을 저장할 수 있는 **메모리 공간을 확보**하고, 그 공간에 변수 이름을 연결해 **값을 저장할 준비를 하는 것**.
- 자바스크립트에서 변수 선언을 위해서는 **`var`, `let`, `const`의 키워드**를 사용.
- 🏷️**키워드: 자바스크립트 엔진이 수행할 동작을 규정한 일종의 명령어**로, 자바스크립트 엔진은 키워드를 만나면 약속된 동작을 수행함.

~~~javascript
var score;
~~~

![4-3]({{site.url}}/images/2025-09-14-javascript-2/3.png)

- 위의 코드는 변수를 선언한 후 변수에 값을 할당하지 않았으므로, **자바스크립트 엔진에 의해 `undefined`라는 값이 암묵적으로 할당**.
- 변수 선언은 **1단계: 변수 선언 -> 2단계: 초기화**로 이루어진다.
- 🏷️**초기화: 변수가 선언된 이후 최초로 값을 할당하는 것**
- 만약 선언하지 않은 식별자에 접근하면 **등록된 식별자를 찾을 수 없을때 발생하는 에러**인 `ReferenceError(참조 에러)`가 발생한다.

# 4.4. 변수 선언의 실행 시점과 변수 호이스팅
```javascript
console.log(score); // undefined

var score; // 변수 선언문
```
- 자바스크립트 코드는 인터프리터에 의해 한 줄씩 순차적으로 실행되므로 **`console.log(score);`가 가장 먼저 실행**된다. 하지만 `console.log(score);`는 ReferenceError가 아닌, **undefined가 출력된다.**
  
- 자바스크립트 에서는 소스코드를 실행할 준비를 하는 동안, **변수 선언을 포함한 모든 식별자들(변수, 함수, 클래스 등)은 런타임이 아닌 그 이전 단계에서 먼저 실행**되기 때문. 그 이후에 선언문을 제외한 소스코드들을 한 줄씩 순차적으로 실행함.
- 이처럼 **변수 선언문이 코드의 선두로 끌어 올려진 것처럼 동작하는 자바스크립트 고유의 특징을 🏷️변수 호이스팅(variable hoistiong)** 이라고 함.

# 4.5. 값의 할당
- 변수에 값을 할당할 때는 할당 연산자 `=`를 사용하며, 우변의 값을 좌변의 변수에 할당
~~~javascript
var score = 80;
~~~
- 변수 선언은 런타임 이전에 먼저 실행되지만, **값의 할당은 순차적으로 런타임에 실행**
- 위의 소스코드와 같이 한 문장으로 표현해도, **선언과 값의 할당은 2개의 문으로 나누어 각각 실행**됨.
- 또한, undefined가 저장되어 있던 메모리 공간이 아닌 **새로운 메모리 공간을 확보 하고 그곳에 저장**함을 유의.
- 이후 undefined 같이 필요없어진 불필요한 값들은 이후 가비지 콜렉터에 의해 메모리에서 자동 해제됨. (언제인지는 알수없음)

# 4.6. 값의 재할당
- 🏷️**재할당: 이미 값이 할당되어 있는 변수에 기존 값을 버리고 새로운 값을 다시 할당하는 것**
~~~javascript
var score = 80;
score = 90; //값의 재할당
~~~
- 값을 재할당할 수 없는 변수를 상수라고 하며, const 키워드를 사용해 선언함.

# 4.7. 식별자 네이밍 규칙
> 1. 식별자는 특수문자를 제외한 문자, 숫자, 언더스코어(_), 달러 기호($)를 포함할 수 있다.
> 2. 단, 식별자는 특수문자를 제외한 문자, 언더스코어(_), 달러 기호($)로 시작해야 한다. 숫자로 시작하는 것은 허용하지 않는다.
> 3. 예약어는 식별자로 사용할 수 없다.

- 🏷️예약어: 프로그래밍 언어에서 사용되고 있거나 사용될 예정인 단어
- 예) await, break, catch, const, false 등

```javascript
var first-name; // SyntaxError: Unexpected token –
var 1st;        // SyntaxError: Invalid or unexpected token
var this;       // SyntaxError: Unexpected token this
```
- 위 예제의 식별자들은 명명 규칙에 위배 된다.
```javascript
var firstname;
var firstName;
var FIRSTNAME;
```
- 자바스크립트는 대소문자를 구별하므로, 위 예제의 세 변수는 별개의 함수이다.
- **변수의 이름은 변수의 존재 목적을 쉽게 이해할 수 있도록** 위의 `score` 변수명 같이 의미를 명확히 표현해야 한다.

- 아래의 네가지 네이밍 컨벤션을 잘 지켜 변수명을 만들자.
```javascript
// 카멜 케이스 (camelCase)
var firstName;

// 스네이크 케이스 (snake_case)
var first_name;

// 파스칼 케이스 (PascalCase)
var FirstName;

// 헝가리언 케이스 (typeHungarianCase)
var strFirstName; // type + identifier
var $elem = document.getElementById('myId'); // DOM 노드
var observable$ = fromEvent(document, 'click'); // RxJS 옵저버블
```
- 주로 **변수나 함수의 이름에는 카멜 케이스**를, **생성자 함수, 클래스의 이름에는 파스칼 케이스를 사용**한다.